Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/the_deceaseds_estate/dealing_with_the_deceaseds_estate.html.txt.tmx
Source language: en
Languages: ga

source: Even if there isn't enough money in the estate to meet all the debts, the relatives of the deceased are not personally responsible or liable for the deceased's debts (unless, of course they had guaranteed them)
ga: Fiú muna bhfuil dóthain airgid san eastát leis na fiacha ar fad a íoc, ní thiteann na fiacha ar ghaolta an mhairbh go pearsanta agus ní gá doibh iad a íoc. (ach amháin sa chás go bhfuil na fiacha urraithe acu)

source: Contact the Probate Office to obtain the personal application probate form
ga: Déan teagmháil leis an Oifig Phrobháide leis an bhfoirm iarratais phearsanta phrobháide a fháil

source: This form is for use by personal applicants only
ga: Úsáideann iarratasóirí pearsanta amháin an fhoirm seo

source: It is not for use by those applying through a solicitor
ga: Ní úsáideann iad siúd a dhéanann iarratas trí aturnae an fhoirm seo

source: This application form is also available from your District Probate Registry
ga: Tá fáil ar an bhfoirm seo freisin ó do Chlárlann Phrobháide Dúiche

source: Staff in the Registry will be able to provide assistance
ga: Beidh baill foirne sa Chlárlann in ann cúnamh a chur ar fáil

source: The application, along with the required documentation, should be returned to the Registry in the area where the deceased lived at the date of death
ga: Ba cheart an t-iarratas, mar aon leis an doiciméadúchán riachtanach, a sheoladh ar ais chuig an gClárlann atá sa cheantar inar chónaigh an marbh tráth dháta an bháis

source: Obtaining a copy of a will
ga: Cóip d’uacht a fháil

source: Once a grant of probate (or letters of administration) has been issued, anybody can apply for copies of the grant and the will using Form PAS1 (pdf)
ga: A luaithe a eisítear deonú probháide (nó litreacha riaracháin), féadfaidh aon duine iarratas a dhéanamh ar chóipeanna den deonú agus den uacht trí úsáid a bhaint as Foirm PAS1 (pdf)

source: The grant sets out the name and address of the executor or administrator of the estate and the name of the solicitor acting on their behalf (if any)
ga: Leagtar amach sa deonú ainm agus seoladh sheiceadóir nó riarthóir an eastáit agus ainm an aturnae a ghníomhaíonn thar a gceann (más ann dó/di)

source: It also sets out the gross value and the net value of the estate
ga: Leagtar amach ann, chomh maith, oll-luach agus glanluach an eastáit

source: Detailed information about the estate is not normally available to the general public, however, certain people may be able to inspect the Inland Revenue Affidavit
ga: Ní gnách go mbíonn faisnéis mhionsonraithe ar fáil don phobal i gcoitinne faoin eastát, ach b’fhéidir go mbeidh daoine áirithe in ann an Mhionscríbhinn Ioncam Intíre a scrúdú, áfach

source: • A beneficiary who is named in the will
ga: • Tairbhí atá ainmnithe san uacht

source: • Someone who is entitled to a share of the estate
ga: • Duine éigin atá i dteideal sciar den eastát a fháil

source: • A child who is entitled to bring proceedings against the estate under Section 117 of the Succession Act 1965
ga: • Leanbh atá i dteideal imeachtaí a thionscnamh i gcoinne an eastáit faoi Alt 117 den Acht Comharbais, 1965

source: Information on obtaining a copy of a will is available on the Courts Service website as well as in the information notes of Form PAS1
ga: Tá faisnéis ar chóip d’uacht a fháil ar fáil ar láithreán gréasáin na Seirbhíse Cúirteanna, agus i nótaí faisnéise Fhoirm PAS1
